prototypes/documents/app/controllers/blocks_controller.rb

SELECT * FROM `blocks` WHERE (`blocks`.document_id = 1) ORDER BY position
UPDATE `blocks` SET `content` = '--- !ruby/object:DocumentItem::Paragraph \ncontent: Paragraph 1, V2\n', `updated_at` = '2010-12-09 18:53:55' WHERE `id` = 1
---
  def update
    @block = Block.find(params[:id])

    item = params[:block][:type].classify.constantize.new(params[:block][:params])

    @block.item = item
    @block.save