prototypes/documents/app/controllers/documents_controller.rb

SELECT * FROM `documents`
---
  def index
    @documents = Document.all

SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
SELECT `blocks`.* FROM `blocks` WHERE (`blocks`.document_id = 1) ORDER BY position
---
  def show
    @document = Document.find(params[:id], :include => :blocks)

SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
SELECT * FROM `versions` WHERE (obj_id = 1 AND obj_type = 'Document') ORDER BY version DESC LIMIT 1
---
  def version
    @version = Document.find(params[:id]).version(params[:number])

SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
---
  def edit
    @document = Document.find(params[:id])